void setup() {
Serial.begin(9600); // تنظیم سرعت انتقال داده روی پورت سریال بر روی 9600 بیت بر ثانیه 
}

void loop() {
for(int i = 0 ; i <360 ; i++)
  }// یک حلقه برای تکرار محاسبات برای تمام زوایا از 0 تا 360 درجه
float y1 = sin(PI/180); // محاسبه سینوس زاویه i (توجه کنید که زاویه باید بر حسب رادیان باشد) 
float y2 = cos(PI/180); // محاسبه کسینوس زاویه i 
Serial.print(y1); // چاپ مقدار سینوس بر روی پورت سریال 
Serial.print(" "); // چاپ یک فاصله برای جدا کردن مقادیر 
Serial.println(y2); // چاپ مقدار کسینوس بر روی پورت سریال و رفتن به خط بعدی
delay(10); // مکث به مدت 10 میلی ثانیه برای جلوگیری از ارسال داده با سرعت بالا 
} 
}
